In [2]:
import pandas as pd

In [3]:
import numpy as np

In [6]:
numbers = np.random.randint(1,1000,10000)
len(numbers)

10000

In [10]:
%%timeit -n 100
total = 0
for i in numbers:
    total += i
avg = total/len(numbers)

736 µs ± 110 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [11]:
%%timeit -n 100
total = np.sum(numbers)
avg = total/len(numbers)

9.67 µs ± 3.41 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [12]:
numbers

array([789, 517, 822, ..., 300, 174, 204])

In [15]:
num = pd.Series(numbers)

In [16]:
num

0       789
1       517
2       822
3       105
4       243
       ...
9995    115
9996    338
9997    300
9998    174
9999    204
Length: 10000, dtype: int32

In [17]:
num[0]

789

In [18]:
num.iloc[0]

789

In [19]:
num.head()

0    789
1    517
2    822
3    105
4    243
dtype: int32

In [20]:
num+2

0       791
1       519
2       824
3       107
4       245
       ...
9995    117
9996    340
9997    302
9998    176
9999    206
Length: 10000, dtype: int32

In [24]:
type(num)

pandas.core.series.Series

In [27]:
%%timeit -n 10
numbers = pd.Series(np.random.randint(1,1000,10000))
for label,value in numbers.iteritems():
    numbers.loc[label] += value + 2

<magic-timeit>:2: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.

478 ms ± 17.7 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [28]:
%%timeit -n 100
numbers = pd.Series(np.random.randint(1,1000,10000))
numbers += 2

283 µs ± 74.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [31]:
record1 = pd.Series({"class": "English","lecturer":"Manju","Score":95})
record2 = pd.Series({"class": "Maths","lecturer":"Vijay","Score":98})
record3 = pd.Series({"class": "Science","lecturer":"Mishra","Score":99})

In [32]:
df = pd.DataFrame([record1,record2,record3] ,["period1","Period2","Period3"])

In [33]:
df

           class lecturer  Score
period1  English    Manju     95
Period2    Maths    Vijay     98
Period3  Science   Mishra     99

In [35]:
type(df["Score"])

pandas.core.series.Series

In [36]:
record1

class       English
lecturer      Manju
Score            95
dtype: object

In [37]:
df['Score']["period1"]

95

In [43]:
df['Score']

period1    95
Period2    98
Period3    99
Name: Score, dtype: int64

In [44]:
df['lecturer']

period1     Manju
Period2     Vijay
Period3    Mishra
Name: lecturer, dtype: object

In [50]:
df[["class","Score"]][0:1]

           class  Score
period1  English     95

In [56]:
df[['class','Score']].loc["period1"]

class    English
Score         95
Name: period1, dtype: object

In [60]:
data = np.random.randint(10,100,[3,3])

In [61]:
data

array([[23, 45, 63],
       [37, 58, 79],
       [18, 17, 90]])

In [62]:
df = pd.DataFrame(data,index = ['first','second','third'])

In [63]:
df

         0   1   2
first   23  45  63
second  37  58  79
third   18  17  90

In [69]:
df.shape

(3, 3)

In [71]:
df[0]   # We can give column name directly but not row name

first     23
second    37
third     18
Name: 0, dtype: int32

In [72]:
df[0]['first'] # first col and then row

23

In [87]:
df[0]  # Buy this we can directly access the whole column by its name

first     23
second    37
third     18
Name: 0, dtype: int32

In [89]:
df.loc["second"]  # we have to use loc[] to read the whole row

37

In [90]:
df.loc["second"][1:]

1    58
2    79
Name: second, dtype: int32

In [91]:
df

         0   1   2
first   23  45  63
second  37  58  79
third   18  17  90

In [92]:
df+3

         0   1   2
first   26  48  66
second  40  61  82
third   21  20  93

In [93]:
df[4] = [100,200,300]

In [94]:
df

         0   1   2    4
first   23  45  63  100
second  37  58  79  200
third   18  17  90  300

In [95]:
df.loc["fouth"] = [1000,2000,3000,4000]

In [96]:
df

           0     1     2     4
first     23    45    63   100
second    37    58    79   200
third     18    17    90   300
fouth   1000  2000  3000  4000

In [97]:
df*2

           0     1     2     4
first     46    90   126   200
second    74   116   158   400
third     36    34   180   600
fouth   2000  4000  6000  8000

In [98]:
df.T

   first  second  third  fouth
0     23      37     18   1000
1     45      58     17   2000
2     63      79     90   3000
4    100     200    300   4000

In [100]:
df = df.T

In [101]:
df["first"]

0     23
1     45
2     63
4    100
Name: first, dtype: int64

In [104]:
df.iloc[0]

first       23
second      37
third       18
fouth     1000
Name: 0, dtype: int64

In [105]:
copy_df = df.copy()

In [106]:
copy_df.drop(0)

   first  second  third  fouth
1     45      58     17   2000
2     63      79     90   3000
4    100     200    300   4000

In [108]:
copy_df.loc[2] = [20,30,40,50]

In [109]:
copy_df

   first  second  third  fouth
0     23      37     18   1000
1     45      58     17   2000
2     20      30     40     50
4    100     200    300   4000

In [110]:
copy_df.drop(0,inplace=True)

In [111]:
copy_df

   first  second  third  fouth
1     45      58     17   2000
2     20      30     40     50
4    100     200    300   4000

In [112]:
copy_df.drop('first',axis=1,inplace=True)

In [113]:
copy_df

   second  third  fouth
1      58     17   2000
2      30     40     50
4     200    300   4000

In [114]:
list(df.columns)

['first', 'second', 'third', 'fouth']

In [115]:
list(df.index)

[0, 1, 2, 4]

In [117]:
df.columns

Index(['first', 'second', 'third', 'fouth'], dtype='object')

In [118]:
copy_df.columns

Index(['second', 'third', 'fouth'], dtype='object')

In [125]:
copy_df.rename(columns={ 'first': "third"},inplace=True)

In [126]:
copy_df

   third  third  third
1     58     17   2000
2     30     40     50
4    200    300   4000

In [127]:
df['third']

0     18
1     17
2     90
4    300
Name: third, dtype: int64

In [129]:
del copy_df['third']

In [130]:
copy_df

Empty DataFrame
Columns: []
Index: [1, 2, 4]

In [131]:
del copy_df

In [133]:
df

   first  second  third  fouth
0     23      37     18   1000
1     45      58     17   2000
2     63      79     90   3000
4    100     200    300   4000

In [139]:
ser = df["third"] > 50

In [140]:
type(ser)

pandas.core.series.Series

In [141]:
ser

0    False
1    False
2     True
4     True
Name: third, dtype: bool

In [143]:
df.where(ser).dropna()

   first  second  third   fouth
2   63.0    79.0   90.0  3000.0
4  100.0   200.0  300.0  4000.0

In [144]:
df[df["third"] > 50]

   first  second  third  fouth
2     63      79     90   3000
4    100     200    300   4000

In [145]:
df

   first  second  third  fouth
0     23      37     18   1000
1     45      58     17   2000
2     63      79     90   3000
4    100     200    300   4000

In [146]:
(df["second"]>50) and (df["third"]>50)   # WE CANNOT COMPARE TWO DATA SERIES TOGETHER, SO TO DO SO WE HAVE & AND | OPERATOR

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [147]:
(df["second"]>50) & (df["third"]>50)

0    False
1    False
2     True
4     True
dtype: bool

In [148]:
(df["second"]>50) |(df["third"]>50)

0    False
1     True
2     True
4     True
dtype: bool